tsuyoshi-otake/m5stamp-p4-c6-linux/linux/boot-shim/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_TASK_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_INT_WDT=n
# C68-CLEAN-RELEASE: do not start CPU1 as a FreeRTOS secondary core.
CONFIG_FREERTOS_UNICORE=y
